app/Controllers/Home.php

    public function index()
    {
        // Load the model
        $mobilModel = new MobilModel();

        // Fetch all the mobils from the database
        $data['mobils'] = $mobilModel->findAll();
---
SELECT *
FROM `mobil`